cask "1password"
cask "1password-cli"
cask "alfred"
cask "cyberduck"
cask "db-browser-for-sqlite"
cask "discord"
cask "docker"
cask "dropbox"
cask "figma"
cask "font-hack-nerd-font"
cask "font-firacode-nerd-font"
cask "fork"
cask "google-chrome"
cask "google-cloud-sdk"
cask "gpg-suite"
cask "hammerspoon"
cask "hyper"
cask "iina"
cask "insomnia"
cask "iterm2"
cask "kap"
cask "karabiner-elements"
cask "keybase"
cask "ngrok"
cask "notion"
cask "sequel-pro"
cask "slack"
cask "the-unarchiver"
cask "virtualbox"
cask "visual-studio-code"
cask "zoom"