brew "ack"
brew "cmake" # for YouCompleteMe vim plugin
brew "coreutils" # for awesome commands like timeout
brew "curl"
brew "diff-so-fancy"
brew "doctl"
brew "ffmpeg" # for being able to manipulate videos for example
brew "fish"
brew "flake8" # for linting Python files
brew "gifsicle" # for gif_compress fish function
brew "git"
brew "git-crypt"
brew "git-open"
brew "go"
brew "gpg2"
brew "htop"
brew "httpie"
brew "httping"
brew "imagemagick"
brew "jq"
brew "libxml2"
brew "mas-cli/tap/mas"
brew "mosh"
brew "nmap"
brew "node"
brew "openssl"
brew "p7zip"
brew "pipenv"
brew "poppler" # to work with pdf files and merge/extract them for example
brew "python"
brew "reattach-to-user-namespace" # for tmux commands to work
brew "redis"
brew "ruby" # for Vim command-t plugin to work
brew "ssh-copy-id"
brew "starship"
brew "terraform"
brew "tldr"
brew "tmux"
brew "trash"
brew "tree"
brew "twine-pypi" # for packaging Pypi packages, needed by setup.py repo
brew "vault"
brew "vim"
brew "wget"
brew "wifi-password"
brew "yarn"
brew "youtube-dl"
brew "z"
