tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
brew "ack"
brew "cmake" # for YouCompleteMe vim plugin
brew "coreutils" # for awesome commands like timeout
brew "curl"
brew "diff-so-fancy"
brew "doctl"
brew "ffmpeg" # for being able to manipulate videos for example
brew "fish"
brew "flake8" # for linting Python files
brew "gifsicle" # for gif_compress fish function
brew "git"
brew "git-crypt"
brew "git-open"
brew "go"
brew "gpg2"
brew "htop"
brew "httpie"
brew "httping"
brew "imagemagick"
brew "jq"
brew "libxml2"
brew "mas-cli/tap/mas"
brew "mosh"
brew "nmap"
brew "node"
brew "openssl"
brew "p7zip"
brew "pipenv"
brew "poppler" # to work with pdf files and merge/extract them for example
brew "python"
brew "reattach-to-user-namespace" # for tmux commands to work
brew "redis"
brew "ruby" # for Vim command-t plugin to work
brew "ssh-copy-id"
brew "starship"
brew "terraform"
brew "tldr"
brew "tmux"
brew "trash"
brew "tree"
brew "twine-pypi" # for packaging Pypi packages, needed by setup.py repo
brew "vault"
brew "vim"
brew "wget"
brew "wifi-password"
brew "yarn"
brew "youtube-dl"
brew "z"
cask_args appdir: "~/Applications"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "cyberduck"
cask "discord"
cask "docker"
cask "dropbox"
cask "homebrew/cask-versions/firefox-developer-edition"
cask "fork"
cask "foxitreader"
cask "google-chrome"
cask "google-cloud-sdk"
cask "gpg-suite"
cask "hammerspoon"
cask "hyper"
cask "iina"
cask "insomnia"
cask "iterm2"
cask "kap"
cask "karabiner-elements"
cask "keybase"
cask "ngrok"
cask "numi"
cask "skype"
cask "slack"
cask "the-unarchiver"
cask "transmission"
cask "tunnelblick"
cask "typora"
cask "visual-studio-code"
cask "zoomus"
mas "Spark", id: 1176895641
mas "NordVPN IKE", id: 1116599239 
mas "Termius", id: 1176074088
mas "Transmit", id: 1436522307
mas "Trello", id: 1278508951
