# cask "1password"
# cask "1password-cli"
cask "alfred"
cask "cyberduck"
cask "discord"
cask "docker"
cask "dropbox"
cask "homebrew/cask-versions/firefox-developer-edition"
cask "font-fira-mono-for-powerline" # for iTerm2 powerline
cask "font-firacode-nerd-font"
cask "font-hack-nerd-font"
cask "fork"
cask "foxitreader"
cask "gimp"
cask "google-chrome"
cask "google-cloud-sdk"
cask "gpg-suite"
cask "hammerspoon"
cask "hyper"
cask "iina"
cask "insomnia"
cask "iterm2"
cask "kap"
cask "karabiner-elements"
cask "keybase"
cask "ngrok"
cask "numi"
cask "sequel-pro"
cask "skype"
cask "slack"
cask "the-unarchiver"
cask "toggl"
cask "transmission"
cask "tunnelblick"
cask "typora"
cask "virtualbox"
cask "visual-studio-code"
cask "zoomus"
